app/Controllers/FoodController.php

    public function index()
    {
        $model = new FoodModel();
        $data['foods'] = $model->findAll();
---
SELECT *
FROM `foods`

    public function thumbnail()
    {
        $model = new FoodModel(); // Replace 'YourModel' with your actual model name

        // Retrieve records with visible=1 and sort by created_at in descending order
        $thumbnails = $model->select('id, name, image, created_at')
            ->where('visible', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `id`, `name`, `image`, `created_at`
FROM `foods`
WHERE `visible` = 1
ORDER BY `created_at` DESC

    public function view($thumbnailId)
    {
        $model = new FoodModel(); // Replace 'YourModel' with your actual model name

        $thumbnail = $model->find($thumbnailId);
---
SELECT *
FROM `foods`
WHERE `foods`.`id` = '2'