app/Controllers/NewsController.php

SELECT *
FROM `news`
---
    public function index()
    {
        $model = new NewsModel();
        $data['news'] = $model->findAll();

SELECT *
FROM `news`
WHERE `news`.`id` = '2'
---
    public function edit($id)
    {
        $model = new NewsModel();
        $record = $model->find($id);